rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
// ============================================================
//  TROTADORA PARA RATAS — Control PID v9.8
//  Plataforma: ESP32 + Driver VNH5019 + Sensor Hall + KY-040
//
//  Cambios v9.7 → v9.8:
//    - NUEVO: log crudo "imán por imán" (pulseLogBuffer), separado
//      del filtro de mediana/EMA que usa el PID.
//    - Cada pulso del Hall genera una muestra {periodo_us, rpm, vel}
//      calculada SIN filtrar, que se acumula hasta el próximo
//      broadcastState() y se envía como array "pulses" en el JSON
//      del WebSocket.
//    - El cliente web (monitoreo.html) arma con esto un CSV aparte
//      ("CSV imán por imán") para graficar velocidad instantánea
//      por imán fuera del ESP32 (Excel/Python).
//    - No se modifica el camino de control del PID (sigue usando
//      el filtro de mediana + EMA existente).
// ============================================================

#include <Arduino.h>
#include <WiFi.h>
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <ArduinoJson.h>
#include <LittleFS.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>
#include <QuickPID.h>
#include <algorithm>
#include "motor_config.h"
#include <ESP32Encoder.h>

// ============================================================
// 1. RED / SERVIDOR
// ============================================================
const char* ssid       = "ESP32_Motor_Control";
const char* apPassword = "12345678";

AsyncWebServer server(80);
AsyncWebSocket ws("/ws");

bool          isWebConnected  = false;
unsigned long lastWsSendTime  = 0;
const unsigned long WS_SEND_INTERVAL = 200;

// ============================================================
// 2. CONSTANTES PWM / FÍSICAS
// ============================================================
#undef  HALL_DEBOUNCE_US
#define HALL_DEBOUNCE_US  1000UL

// Límites de salida del PID
#define PID_OUTPUT_MIN   150          // PWM mínimo para vencer fricción estática
#define PID_OUTPUT_MAX   MAX_VELOCITY // 1023

static_assert(HALL_BUFFER_SIZE > 1, "HALL_BUFFER_SIZE debe ser > 1");

static const float HALL_CONST_RPM   = 60000000.0f / (float)MAGNETS_COUNT;
static const float HALL_CONST_SPEED = (3.14159265f * DRIVE_ROLLER_DIAMETER_MM * 1000.0f)
                                       / (float)MAGNETS_COUNT;

// ============================================================
// 3. TEMPORIZACIÓN
// ============================================================
#define CONTROL_INTERVAL_MS   100UL
#define LCD_UPDATE_INTERVAL   300UL
#define DEBUG_INTERVAL        1000UL
#define CURRENT_READ_INTERVAL 50UL

// ============================================================
// 4. FILTRO DE MEDIANA + EMA
// ============================================================
#define FILTER_SIZE   5
#define SMOOTH_ALPHA  0.5f

static uint32_t filterBuffer[FILTER_SIZE];
static uint8_t  filterIndex = 0;
static uint8_t  filterCount = 0;

static float filteredRPM_Last = 0.0f;
static float filteredVel_Last = 0.0f;

// ============================================================
// 5. VARIABLES DE VELOCIDAD / PID
// ============================================================
float currentRPM           = 0.0f;
float currentLinearSpeedMs = 0.0f;
float setpointSpeed        = 0.0f;   // Setpoint activo (confirmado)
float pendingSetpoint      = 0.0f;   // Setpoint temporal del encoder
float pidOutput            = 0.0f;
bool  setpointPending      = false;  // Hay un setpoint pendiente de confirmar

QuickPID myPID(&currentLinearSpeedMs, &pidOutput, &setpointSpeed,
               150.0f, 60.0f, 40.0f, QuickPID::Action::direct);

// ============================================================
// 6. BUFFER CIRCULAR HALL
// ============================================================
static volatile uint32_t hallPeriodBuffer[HALL_BUFFER_SIZE] = {0};
static volatile uint8_t  hallBufferHead  = 0;
static volatile uint8_t  hallBufferCount = 0;
static volatile uint32_t lastHallMicros  = 0;
static uint8_t           lastProcessedHead = 0;

// ============================================================
// 6b. LOG CRUDO IMÁN POR IMÁN (para CSV, no usado por el PID)
// ============================================================
// Tamaño holgado: a las velocidades de esta trotadora se esperan
// pocos imanes por intervalo de broadcast (200 ms). Si tu motor
// gira mucho más rápido o tenés muchos imanes, subí este valor.
#define PULSE_LOG_SIZE 32

struct PulseSample {
  uint32_t periodo_us;  // período crudo entre este imán y el anterior
  float    rpm;         // RPM instantánea calculada de ese período
  float    vel_m_s;     // velocidad lineal instantánea de ese período
};

// Estos buffers solo se tocan desde loop() (calculateSpeed produce,
// broadcastState consume y vacía) — no hay acceso desde la ISR,
// así que no requieren protección contra interrupciones.
static PulseSample pulseLogBuffer[PULSE_LOG_SIZE];
static uint8_t     pulseLogCount    = 0;
static bool        pulseLogOverflow = false;

// ============================================================
// 7. ENCODER KY-040
// ============================================================
ESP32Encoder encoder;
int           lastStableCount    = 0;
unsigned long lastStableTime     = 0;
const unsigned long ENCODER_STABILITY_DELAY_MS = 5;
int           displayEncoderCount = 0;

volatile bool encoderButtonPressed  = false;
unsigned long lastButtonDebounce    = 0;
const unsigned long ENCODER_BUTTON_DEBOUNCE_MS = 50;

// ============================================================
// 8. PARADA DE EMERGENCIA
// ============================================================
volatile bool emergencyStopTriggered = false;
bool          emergencyStopPending   = false;
unsigned long lastEmergencyDebounce  = 0;
const unsigned long EMERGENCY_DEBOUNCE_MS = 100;

// ============================================================
// 9. CORRIENTE
// ============================================================
float         cachedCurrent       = 0.0f;
unsigned long lastCurrentReadTime = 0;

