rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
// ============================================================
// 10. LCD
// ============================================================
LiquidCrystal_I2C* lcd        = nullptr;
unsigned long      lastLcdUpdate = 0;

// ============================================================
// 11. SERIAL
// ============================================================
static char    serialBuf[64];
static uint8_t serialIdx = 0;
unsigned long  lastDebugTime = 0;

// ============================================================
// 12. LED
// ============================================================
#define LED_BUILTIN_PIN 2
unsigned long lastBlink = 0;

// ============================================================
// 13. DECLARACIONES ANTICIPADAS
// ============================================================
void broadcastState();
void motorStop();

// ============================================================
// 14. IMPLEMENTACIÓN DE FUNCIONES
// ============================================================

void applyPWM(int pwmVal) {
  pwmVal = constrain(pwmVal, 0, MAX_VELOCITY);
#if ESP_IDF_VERSION_MAJOR >= 5
  ledcWrite(MOTOR_PWM_PIN, (uint32_t)pwmVal);
#else
  ledcWrite(PWM_CHANNEL, (uint32_t)pwmVal);
#endif
}

void configurarMotorReversa() {
  digitalWrite(MOTOR_IN1_PIN, LOW);
  digitalWrite(MOTOR_IN2_PIN, HIGH);
}

void motorParadaLibre() {
  digitalWrite(MOTOR_IN1_PIN, LOW);
  digitalWrite(MOTOR_IN2_PIN, LOW);
}

// ---------------------
// motorStop: apaga motor, limites neutros, PID en manual
// ---------------------
void motorStop() {
  setpointSpeed   = 0.0f;
  pendingSetpoint = 0.0f;
  setpointPending = false;
  pidOutput       = 0.0f;
  applyPWM(0);
  motorParadaLibre();

  // Límites neutros y PID en manual para que no actúe sin setpoint
  myPID.SetOutputLimits(0, PID_OUTPUT_MAX);
  myPID.SetMode(QuickPID::Control::manual);
}

// ---------------------
// activarPID: feed-forward + límites correctos + modo automático
// ---------------------
static void activarPID(float sp) {
  // Reset integrador: manual → automático
  myPID.SetMode(QuickPID::Control::manual);

  // Feed-forward proporcional al setpoint (precarga pidOutput)
  pidOutput = PID_OUTPUT_MIN
              + (sp / 2.0f) * (float)(PID_OUTPUT_MAX - PID_OUTPUT_MIN);
  pidOutput = constrain(pidOutput, (float)PID_OUTPUT_MIN, (float)PID_OUTPUT_MAX);

  // Límites reales: nunca baja de PID_OUTPUT_MIN mientras hay setpoint
  myPID.SetOutputLimits(PID_OUTPUT_MIN, PID_OUTPUT_MAX);

  // Activar PID en automático con pidOutput precargado
  myPID.SetMode(QuickPID::Control::automatic);

  // ========== AGREGAR AQUÍ LOS PRINTS ==========
  Serial.printf("[PID] Modo: %s | SP: %.3f | Current: %.3f | Error: %.3f\n", 
    (myPID.GetMode() == (uint8_t)QuickPID::Control::automatic) ? "AUTO" : "MANUAL",
    setpointSpeed, currentLinearSpeedMs, setpointSpeed - currentLinearSpeedMs);
  Serial.printf("[PID] Kp=%.2f Ki=%.2f Kd=%.2f\n", myPID.GetKp(), myPID.GetKi(), myPID.GetKd());
  // ============================================

  applyPWM((int)pidOutput);
  Serial.printf("[PID] Activado — SP: %.3f m/s | FF PWM: %.0f\n", sp, pidOutput);
}

// ---------------------
// confirmarSetpoint: aplica setpoint pendiente del encoder
// ---------------------
void confirmarSetpoint() {
  if (!setpointPending) return;

  setpointSpeed = constrain(pendingSetpoint, 0.0f, 2.0f);
  setpointPending = false;

  if (setpointSpeed == 0.0f) {
    motorStop();
    Serial.println("[ENCODER] Setpoint confirmado: 0 — Motor detenido");
  } else {
    configurarMotorReversa();
    activarPID(setpointSpeed);
    Serial.printf("[ENCODER] Setpoint confirmado: %.3f m/s\n", setpointSpeed);
  }

  broadcastState();
}

// ---------------------
// procesarEntradasEncoder
// ---------------------
void procesarEntradasEncoder() {
  int rawCount      = encoder.getCount();
  unsigned long ahora = millis();

  if (rawCount != lastStableCount) {
    lastStableTime  = ahora;
    lastStableCount = rawCount;
  }

  if ((ahora - lastStableTime) >= ENCODER_STABILITY_DELAY_MS) {
    int newDisplayCount = rawCount / 2;

    if (newDisplayCount != displayEncoderCount) {
      int delta = newDisplayCount - displayEncoderCount;
      displayEncoderCount = newDisplayCount;

      pendingSetpoint += delta * 0.05f;
      pendingSetpoint  = constrain(pendingSetpoint, 0.0f, 2.0f);
      setpointPending  = true;

      Serial.printf("[ENCODER] Setpoint temporal: %.3f m/s (delta: %d)\n",
                    pendingSetpoint, delta);
      broadcastState();
    }
  }

  // Botón: confirmar setpoint pendiente
  if (encoderButtonPressed) {
    unsigned long ahoraMs = millis();
    if (ahoraMs - lastButtonDebounce > ENCODER_BUTTON_DEBOUNCE_MS) {
      confirmarSetpoint();
      lastButtonDebounce = ahoraMs;
    }
    encoderButtonPressed = false;
  }
}

// ============================================================
// 15. ISRs
// ============================================================
void IRAM_ATTR ISR_SensorHall() {
  uint32_t ahora = micros();

  if (lastHallMicros == 0) {
    lastHallMicros = ahora;
    return;
  }

  uint32_t periodo = ahora - lastHallMicros;
  lastHallMicros = ahora;

  if (periodo >= HALL_DEBOUNCE_US) {
    hallPeriodBuffer[hallBufferHead] = periodo;
    hallBufferHead = (hallBufferHead + 1) % HALL_BUFFER_SIZE;
    if (hallBufferCount < HALL_BUFFER_SIZE) hallBufferCount++;
  }
}

void IRAM_ATTR ISR_EncoderBoton() {
  if (millis() - lastButtonDebounce > ENCODER_BUTTON_DEBOUNCE_MS) {
    encoderButtonPressed = true;
  }
}

void IRAM_ATTR ISR_EmergencyStop() {
  emergencyStopTriggered = true;
}

// ============================================================
// 16. CÁLCULO DE VELOCIDAD
// ============================================================
static float getMedian(uint32_t* arr, uint8_t size, uint8_t count) {
  uint32_t temp[FILTER_SIZE];
  uint8_t  n = (count < size) ? count : size;
  if (n == 0) return 0.0f;
  memcpy(temp, arr, n * sizeof(uint32_t));
  std::sort(temp, temp + n);
  return (float)temp[n / 2];
}

// Empuja una muestra cruda (sin filtrar) al log imán por imán.
// Si el buffer está lleno (no se vació a tiempo por broadcastState),
// se descarta la muestra y se marca overflow.
static void logPulsoCrudo(uint32_t periodo_us, float rpm, float vel_m_s) {
  if (pulseLogCount >= PULSE_LOG_SIZE) {
    pulseLogOverflow = true;
    return;
  }
  pulseLogBuffer[pulseLogCount].periodo_us = periodo_us;
  pulseLogBuffer[pulseLogCount].rpm        = rpm;
  pulseLogBuffer[pulseLogCount].vel_m_s    = vel_m_s;
  pulseLogCount++;
}

static void calculateSpeed() {
  uint32_t periods[HALL_BUFFER_SIZE];
  uint8_t  currentHead;
  uint32_t ultimoPulso;

  portDISABLE_INTERRUPTS();
  memcpy(periods, (const void*)hallPeriodBuffer, sizeof(periods));
  currentHead  = hallBufferHead;
  ultimoPulso  = lastHallMicros;
  portENABLE_INTERRUPTS();

  bool timeout = (ultimoPulso == 0) || ((micros() - ultimoPulso) > HALL_TIMEOUT_US);

