rafaelcapurroc-droid/esp32-motor-control/src/main.cpp
  if (timeout) {
    currentRPM           = 0.0f;
    currentLinearSpeedMs = 0.0f;
    filteredRPM_Last     = 0.0f;
    filteredVel_Last     = 0.0f;

    memset(filterBuffer, 0, sizeof(filterBuffer));
    filterCount = 0;
    filterIndex = 0;

    portDISABLE_INTERRUPTS();
    hallBufferCount   = 0;
    hallBufferHead    = 0;
    lastProcessedHead = 0;
    memset((void*)hallPeriodBuffer, 0, sizeof(hallPeriodBuffer));
    portENABLE_INTERRUPTS();
    return;
  }

  uint8_t prevProcessedHead = lastProcessedHead;
  uint8_t newPulses = (currentHead - prevProcessedHead + HALL_BUFFER_SIZE) % HALL_BUFFER_SIZE;
  lastProcessedHead = currentHead;

  if (newPulses == 0) return;

  for (uint8_t i = 0; i < newPulses; i++) {
    uint8_t  idx = (prevProcessedHead + i) % HALL_BUFFER_SIZE;
    uint32_t p   = periods[idx];
    if (p > 200 && p < HALL_TIMEOUT_US) {
      filterBuffer[filterIndex] = p;
      filterIndex = (filterIndex + 1) % FILTER_SIZE;
      if (filterCount < FILTER_SIZE) filterCount++;

      // --- Log crudo imán por imán (independiente del filtro del PID) ---
      float rawRpmSample = HALL_CONST_RPM   / (float)p;
      float rawVelSample = HALL_CONST_SPEED / (float)p;
      logPulsoCrudo(p, rawRpmSample, rawVelSample);
    }
  }

  if (filterCount == 0) return;

  float periodoMediano = getMedian(filterBuffer, FILTER_SIZE, filterCount);

  float rawRPM = HALL_CONST_RPM   / periodoMediano;
  float rawVel = HALL_CONST_SPEED / periodoMediano;

  filteredRPM_Last = (SMOOTH_ALPHA * rawRPM) + ((1.0f - SMOOTH_ALPHA) * filteredRPM_Last);
  filteredVel_Last = (SMOOTH_ALPHA * rawVel) + ((1.0f - SMOOTH_ALPHA) * filteredVel_Last);

  currentRPM           = filteredRPM_Last;
  currentLinearSpeedMs = filteredVel_Last;
}

// ============================================================
// 17. LECTURA DE CORRIENTE
// ============================================================
static void updateCurrentReading() {
  if (millis() - lastCurrentReadTime < CURRENT_READ_INTERVAL) return;
  lastCurrentReadTime = millis();

  uint32_t sum = 0;
  for (int i = 0; i < 20; i++) sum += analogRead(MOTOR_CS_PIN);

  float voltage   = (sum / 20.0f) * (3.3f / 4095.0f);
  float corrected = max(voltage - CS_OFFSET_VOLTAGE, 0.0f);
  cachedCurrent   = corrected / CS_VOLTAGE_PER_AMP;
}

// ============================================================
// 18. COMANDOS SERIAL
// ============================================================
void procesarComandoSerial(const char* cmd) {
  char buf[64];
  strncpy(buf, cmd, sizeof(buf) - 1);
  buf[sizeof(buf) - 1] = '\0';
  for (char* p = buf; *p; p++) *p = toupper((unsigned char)*p);

  float v1;

  if (strncmp(buf, "SET SP ", 7) == 0 && sscanf(buf + 7, "%f", &v1) == 1) {
    float sp = constrain(v1, 0.0f, 2.0f);
    setpointSpeed   = sp;
    pendingSetpoint = sp;
    setpointPending = false;

    if (sp == 0.0f) {
      motorStop();
      Serial.println("[SP] Motor detenido");
    } else {
      configurarMotorReversa();
      activarPID(sp);
      Serial.printf("[SP] Consigna: %.3f m/s\n", sp);
    }

  } else if (strcmp(buf, "GET VEL") == 0) {
    Serial.printf("[VEL] %.3f m/s | SP: %.3f | PWM: %.0f | Pending: %s\n",
      currentLinearSpeedMs, setpointSpeed, pidOutput,
      setpointPending ? "YES" : "NO");

  } else if (strcmp(buf, "GET ENC") == 0) {
    Serial.printf("[ENC] Raw: %d | Display: %d\n",
      encoder.getCount(), displayEncoderCount);

  } else if (strcmp(buf, "RESET ENC") == 0) {
    encoder.clearCount();
    lastStableCount     = 0;
    displayEncoderCount = 0;
    Serial.println("[ENC] Contadores reseteados");

  } else if (strcmp(buf, "GET CUR") == 0) {
    Serial.printf("[CUR] %.2f A\n", cachedCurrent);

  } else if (strcmp(buf, "STOP") == 0) {
    motorStop();
    Serial.println("[STOP] Motor detenido");

  } else if (strncmp(buf, "TUNE ", 5) == 0) {
    float p, i, d;
    if (sscanf(buf + 5, "%f %f %f", &p, &i, &d) == 3) {
      myPID.SetTunings(p, i, d);
      Serial.printf("[TUNE] Kp=%.2f Ki=%.2f Kd=%.2f\n", p, i, d);
    }

  } else if (strcmp(buf, "HELP") == 0) {
    Serial.println("CMD: SET SP <m/s> | GET VEL | GET ENC | RESET ENC | GET CUR | STOP | TUNE <Kp Ki Kd>");

  } else {
    Serial.printf("[ERR] Desconocido: '%s'\n", cmd);
  }
}

static void leerSerial() {
  while (Serial.available()) {
    char c = Serial.read();
    if (c == '\n' || c == '\r') {
      if (serialIdx > 0) {
        serialBuf[serialIdx] = '\0';
        procesarComandoSerial(serialBuf);
        serialIdx = 0;
      }
    } else if (serialIdx < (sizeof(serialBuf) - 1)) {
      serialBuf[serialIdx++] = c;
    }
  }
}

// ============================================================
// 19. WEBSOCKET
// ============================================================
void broadcastState() {
  if (ws.count() == 0) {
    // Sin clientes conectados: no acumulamos el log crudo indefinidamente.
    pulseLogCount    = 0;
    pulseLogOverflow = false;
    return;
  }

  JsonDocument doc;
  doc["velocity"]       = (int)round(pidOutput);
  doc["current"]        = cachedCurrent;
  doc["rpm"]            = currentRPM;
  doc["speed_m_s"]      = currentLinearSpeedMs;
  doc["speed_mm_s"]     = currentLinearSpeedMs * 1000.0f;
  doc["sp_m_s"]         = setpointSpeed;
  doc["sp_pending_m_s"] = setpointPending ? pendingSetpoint : setpointSpeed;
  doc["sp_pending"]     = setpointPending;
  doc["encoder"]        = displayEncoderCount;
  doc["encoder_raw"]    = encoder.getCount();

  // --- Log crudo imán por imán acumulado desde el último broadcast ---
  if (pulseLogCount > 0) {
    JsonArray pulses = doc["pulses"].to<JsonArray>();
    for (uint8_t i = 0; i < pulseLogCount; i++) {
      JsonObject p = pulses.add<JsonObject>();
      p["p"] = pulseLogBuffer[i].periodo_us;  // período crudo en µs
      p["v"] = pulseLogBuffer[i].vel_m_s;     // velocidad instantánea m/s
      p["r"] = pulseLogBuffer[i].rpm;         // rpm instantánea
    }
    pulseLogCount = 0;
  }
  if (pulseLogOverflow) {
    doc["pulses_overflow"] = true;
    pulseLogOverflow = false;
  }

  String json;
  serializeJson(doc, json);
  ws.textAll(json);
}

